Revit 2027 API
Generic.GenericSelfIllumColorTemperature Property
 The property labeled "Color Temperature" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericSelfIllumColorTemperature { get; }
Public Shared ReadOnly Property GenericSelfIllumColorTemperature As String
	Get
public:
static property String^ GenericSelfIllumColorTemperature {
	String^ get ();
}
static member GenericSelfIllumColorTemperature : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace